testCases/Feindt/kOmegaSSTLMRough.Kozulovic2022/0.orig/ReThetat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ReThetat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 324.10;

boundaryField
{
    inlet
    {
        type            ReThetatInlet;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    lowerSymmetry
    {
        type            zeroGradient;
    }

    upperSymmetry
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
