testCases/Feindt/kOmegaSSTLMRough.Kozulovic2022/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../params.in"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 666.67;

boundaryField
{
    lowerWall
    {
        type     omegaWilcoxRoughWallFunction;
        ks       uniform $KS;
	//type     omegaRoughWallFunction;
	//roughnessHeight uniform $KS;
        value    $internalField;
    }
    lowerSymmetry
    {
        type            slip;
    }
    upperSymmetry
    {
        type            slip;
    }
    inlet
    {
        type            omegaViscosityRatio;
        ratio           $RET;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
