testCases/Feindt/kOmegaSSTLMRough.Kozulovic2022/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
      solver           GAMG;
      smoother         GaussSeidel;
      tolerance        1e-6;
      relTol           0.01;
    }

    "(h|U|k|omega|gammaInt|gamma|ReThetat|Ar)"
    {
      solver           smoothSolver;
      smoother         GaussSeidel;
      tolerance        1e-8;
      relTol           0.001;
      minIter          1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    
    //residualControl
    //{
    //    p               1e-5;
    //    U               1e-5;
    //    "(kt|kl|omega)"     1e-5;
    //}
    consistent no;
}

relaxationFactors
{
    fields
    {
        p               0.3; 
    }
    equations
    {
        U                                    0.7; 
        "(k|omega|gammaInt|ReThetat|Ar)"     0.7;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
